In [1]:
import pandas as pd

In [9]:
df = pd.read_csv("work.csv")
df

     Name         city    age py-score
0    Emma      Kampala     23       90
1  Wilber        Mbale     26       75
2   Robin         Gulu     25     mine
3   Tevor  Livingstone    NaN       89
4    Yeko       Tororo     20       94
5  Miriam         Arua  Train      NaN
6   Jesca      Mbarara     21       84

In [10]:
df.shape

(7, 4)

In [3]:
print(df.head())

     Name         city  age py-score
0    Emma      Kampala   23       90
1  Wilber        Mbale   26       75
2   Robin         Gulu   25     mine
3   Tevor  Livingstone  NaN       89
4    Yeko       Tororo   20       94

In [4]:
print(df.tail())

     Name         city    age py-score
2   Robin         Gulu     25     mine
3   Tevor  Livingstone    NaN       89
4    Yeko       Tororo     20       94
5  Miriam         Arua  Train      NaN
6   Jesca      Mbarara     21       84

In [5]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      7 non-null      object
 1   city      7 non-null      object
 2   age       6 non-null      object
 3   py-score  6 non-null      object
dtypes: object(4)
memory usage: 352.0+ bytes
None

In [31]:
df.dropna()

     Name         city      age py-score
0    Emma      Kampala       23       90
1  Wilber        Mbale       26       75
2   Robin         Gulu       25        0
3   Tevor  Livingstone  Missing       89
4    Yeko       Tororo       20       94
6   Jesca      Mbarara       21       84

In [32]:
df.describe()

        Name     city age py-score
count      6        6   6        6
unique     6        6   6        6
top     Emma  Kampala  23       90
freq       1        1   1        1

In [13]:
df.columns

Index(['Name', 'city', 'age', 'py-score'], dtype='object')

In [15]:
df.fillna({'age': 25,'py-score':0})

     Name         city    age py-score
0    Emma      Kampala     23       90
1  Wilber        Mbale     26       75
2   Robin         Gulu     25     mine
3   Tevor  Livingstone     25       89
4    Yeko       Tororo     20       94
5  Miriam         Arua  Train        0
6   Jesca      Mbarara     21       84

In [35]:
df["py-score"].fillna(0, inplace=True)

In [16]:
df.dropna()

     Name     city age py-score
0    Emma  Kampala  23       90
1  Wilber    Mbale  26       75
2   Robin     Gulu  25     mine
4    Yeko   Tororo  20       94
6   Jesca  Mbarara  21       84

In [42]:
df["py-score"].fillna(0, inplace=True)
print(df)

     Name         city      age py-score
0    Emma      Kampala       23       90
1  Wilber        Mbale       26       75
2   Robin         Gulu       25        0
3   Tevor  Livingstone  Missing       89
4    Yeko       Tororo       20       94
6   Jesca      Mbarara       21       84

In [37]:
df["py-score"].replace("mine", 0, inplace=True)
print(df)

     Name         city      age py-score
0    Emma      Kampala       23       90
1  Wilber        Mbale       26       75
2   Robin         Gulu       25        0
3   Tevor  Livingstone  Missing       89
4    Yeko       Tororo       20       94
6   Jesca      Mbarara       21       84

In [43]:

duplicate_rows = df[df.duplicated()]

if len(duplicate_rows) > 0:
    print(duplicate_rows)
else:
    print("There are no duplicate rows.")

There are no duplicate rows.

After removing wrong data:
     Name         city      age py-score
0    Emma      Kampala       23       90
1  Wilber        Mbale       26       75
2   Robin         Gulu       25        0
3   Tevor  Livingstone  Missing       89
4    Yeko       Tororo       20       94
6   Jesca      Mbarara       21       84

In [48]:
df["py-score"] = pd.to_numeric(df["py-score"], errors="coerce")
print("\nData types after converting 'py-score' column:")
print(df.dtypes)

Data types after converting 'py-score' column:
Name        object
city        object
age         object
py-score     int64
dtype: object

In [41]:

null_percentage = (df.isnull().sum() / len(df)) * 100
print("Null Percentage:")
print(null_percentage)

Null Percentage:
Name        0.0
city        0.0
age         0.0
py-score    0.0
dtype: float64